Autodesk.Revit.DB.IExternalParameterServerProxy.ManageParameters(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ProjectParameterAccess)
call the service to manage parameters in Revit
projectParameters:
Provides access to view and upgrade parameters already in the project.

Autodesk.Revit.DB.IExternalParameterServerProxy.SelectParameterProhibitingDataTypes(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeTypeId},Autodesk.Revit.DB.ProjectParameterAccess,System.Collections.Generic.IList{System.String},System.Boolean)
Returns the identity of a shared parameter that does not use any of the given prohibited data types.
If the given set of prohibited data types is empty, the shared parameter can have any data type.
requiresCategoryBinding:
Provides access to view and upgrade parameters already in the project while selecting parameters to add.

Autodesk.Revit.DB.IExternalParameterServerProxy.SelectParameterWithDataType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ProjectParameterAccess,System.Collections.Generic.IList{System.String},System.Boolean)
Returns a selection of parameters with the given data type.
If the given data type is an empty identifier, the selected parameters can have any data type.
requiresCategoryBinding:
Provides access to view and upgrade parameters already in the project while selecting parameters to add.